<template>
  <div class="notes-box">
    <h4 class="title-box">银行存管账户授权委托书</h4>
    <div class="text-box">
      <h6>尊敬的用户，您好：</h6>
      <p> 恭喜您成为北京玖富普惠信息技术有限公司(以下简称“玖富普惠”）平台的实名注册用户。您可作为出借人、借款人或担保人，参与由玖富普惠平台提供的网络借贷及相关服务。</p>
      <p>以下文件的全部内容关系到您的切身利益，请仔细阅读相关条款，在知悉、理解并接受以下全部内容的前提下方可进行后续操作。当您点击“确认”、“同意”或其他类似含义选项时，即视为您已经充分理解并确认以下《授权委托书》的相关内容，并自愿承担相应法律责任和风险。</p>

      <p>《授权委托书》</p>
      <p>授权人：</p>
      <p>证件类型：</p>
      <p>证件号码：</p>

      <p>被授权人：北京玖富普惠信息技术有限公司（以下或简称“玖富普惠”）、华夏银行股份有限公司北京分行(以下或简称“存管人”或“存管银行”)</p>

      <p>鉴于，授权人拟作为出借人、借款人或担保人参与由玖富普惠提供的网络借贷服务，根据相关法律法规的要求，授权人应当在存管银行开立相应的资金存管账户。为给授权人提供更为优质和便捷的服务，根据《网络借贷资金存管业务指引》（银监办发[2017]21号）、《互联网金融个体网络借贷资金存管业务规范》（T/NIFA 3-2017）、《互联网金融个体网络借贷资金存管系统规范》（T/NIFA 4-2017）（包括对其不时进行的补充或修订，以下合称“存管法规及标准”），授权人特此向玖富普惠以及存管银行作出如下授权：</p>

      <p>1、授权人特此授权玖富普惠将授权人的基本信息（包括但不限于姓名或者名称、证件类型、证件号码、银行卡账号等开立资金存管账户所需的信息）、交易信息以及其他信息提交给存管银行，以便存管银行为授权人办理包括但不限于开户、充值、出借、提现、还款/代偿、缴费及其他网络借贷服务相关业务在内的各项业务项下的资金划转。</p>

      <p>2、授权人特此授权玖富普惠管理授权人用于玖富普惠平台业务的数字证书及数字证书的更新。</p>

      <p>3、授权人特此授权玖富普惠根据授权人在后续参与或开通的具体业务项下发出的包括但不限于充值、出借、提现、还款/代偿、缴费在内的交易指令（包括授权人自行做出的交易指令以及玖富普惠依据授权人的另行授权而代为执行的交易指令）向存管银行发送相应的资金划转指令。</p>

      <p>4、受限于存管法规及标准项下的相关限制以及授权人根据以下第5条设定的授权金额和授权期限，授权人特此授权并同意存管银行有权直接执行授权人在玖富普惠各类业务下针对包括但不限于“出借”、“还款”、“缴费”在内的各环节自行或由玖富普惠代为发送的资金划转指令，而无需另行核验授权人的交易密码或安全性不低于交易密码的指令（以下称“业务授权”）。</p>

      <p>5、授权人特此确认，除非授权人根据其他授权文件明示或以其实际行为默示授予玖富普惠和/或存管银行期限更长和/或金额更大的授权，【上述业务授权的授权期限为：10年，授权金额为：单笔资金划转指令不超过人民币10,000,000元。】如授权人超过授权期限后继续使用玖富普惠提供的网络借贷及相关服务的，视为授权人同意将授权期限延长至服务终止时。如授权人在玖富普惠平台出借（投资）的实际金额高于授权金额的，视为授权人同意将授权金额提高至其实际出借（投资）金额。为避免歧义，如果授权人在针对特定业务的相关协议或授权文件中规定期限更短和/或金额更小的授权的，均不构成对本授权委托书项下授权事项的影响或缩小。</p>

      <p>6、授权人特此确认，对本授权委托书项下的任何授权的限缩或终止应当经过玖富普惠的事先同意。如果授权人未经玖富普惠事先同意而限缩或终止本授权委托书项下的任何授权或在存管银行的相关系统中调减相关的授权期限或授权金额导致玖富普惠提供的任何相关服务无法照常开展或造成任何迟延的，玖富普惠均不就此向授权人承担任何责任，若玖富普惠或任何其他第三方因此而遭受任何损失的，授权人应当全额赔偿。</p>
      <p>7、授权人特此确认，本授权委托书采用电子文本形式制成，并保存在玖富普惠（玖富普惠可委托其合作方）为此设立的专用服务器上备查，授权人认可该形式的授权委托书的效力。授权人特此授权玖富普惠，当授权人在玖富普惠平台勾选“我同意”或类似涵义的选项确认本授权委托书后，玖富普惠或玖富普惠委托的第三方合作机构可以调用授权人的数字证书，以授权人的名义签订并代为保管本授权委托书。该调用行为视为授权人本人的操作，因调用授权人电子签章产生的一切法律后果由授权人自行承担，授权人放弃追究玖富普惠及玖富普惠委托的第三方合作机构任何法律责任的权利。</p>
    </div>
    <footer class="footer">
      <p class="check-box g-cen-cen" @click="async = !async">
        <i class="iconfont icon-dui" :class="{'icon-dui1 on':async}"></i>
        我已阅读并同意，银行存管账户授权委托书
      </p>
      <p class="btn-box">
        <button :disabled="!async" @click="submitFn" :class="{'on':async}">下一步</button>
      </p>
    </footer>
  </div>
</template>

<script>
export default {
  data () {
    return {
      async : false
    }
  },
  methods : {
   submitFn () {
     location.href = this.$route.query.url;
   }
  }
}
</script>
<style lang="scss" scoped>
.notes-box{
  background:$col-f;
  padding-bottom: 180px;
  .title-box{
    height: 80px;
    font-size: 40px;
    text-align: center;
    line-height: 80px;
  }
  .text-box {
    padding:0 30px;
    color:$col-3;
    h6{
      font-size: 12px;
      line-height: 60px;
    }
    p{
      font-size: 12px;
      line-height: 40px;
      padding-bottom: 20px;
    }
  }
  .footer{
    position: fixed;
    bottom:0;
    width:100%;
    left:0;
    background:$col-f0;
    .check-box{
      height: 80px;
      font-size: 24px;
      color:$col-6;
      i{
        font-size: 40px;
        margin-right:10px;
        &.on{
          color:$col-red;
        }
      }
    }
    .btn-box{
      button{
        background: $col-red;
        width: 100%;
        height: 80px;
        color:$col-f;
        font-size: 24px;
        border:0;
        opacity: .6;
        &.on{
          opacity: 1;
        }
      }
    }
  }
}
</style>
